{"data":{"markdownRemark":{"html":"<p>This year I did a lot of cool stuff! Let me tell you about it!</p>\n<ul>\n<li>I started my first full-time, non-internship development job at the Nordstrom Innovation Lab!</li>\n<li>In February, <a href=\"https://lizmrush.com/hackathon-lessons/\">I led a hackathon team</a> with Jon Madison and pitched an idea for a full body wearable that generated live music based on biometric feedback. We won first place at the Intel IoT hackathon.</li>\n<li>After the Innovation Lab restructured just two months into the job, I decided that instead of moving to the coporate Nordstrom development teams, I'd take a job at the woman-owned startup <a href=\"http://www.siren.mobi\">Siren</a>. I got to build a lot of iOS features and do full stack development work with a bunch of cool dudes in a historic mansion as an office.</li>\n<li>The Siren team won <a href=\"http://www.geekwire.com/2015/revealed-the-winners-of-the-2015-geekwire-awards/\">Geekwire's App of the Year award</a> in May!</li>\n<li>Also in May, I was the official sketchnoter for Alterconf Seattle. Hooray for paid artwork!</li>\n<li>Who says dating apps don't work? My now-former coworker from Siren is my now-current boyfriend.</li>\n<li>In June I hopped on a plane to SF to spend 6 weeks participating in a pilot techincal fellowship program at Square. I worked on the data platform team with my kickass co-fellow, <a href=\"http://penelopecodes.com\">Penelope Hill</a>.</li>\n<li>In October, I started a new gig at the startup <a href=\"http://algorithmia.com\">Algorithmia</a> as their first developer evangelist.</li>\n<li>In November, I helped my best friend move to Seattle from Salt Lake City.</li>\n<li>At the start of December, Algorithmia landed a spot as one of <a href=\"http://www.geekwire.com/2015/seattle-10-top-startups-sketch-business-models-giant-cocktail-napkins/\">Geekwire's Seattle 10</a>--an award for the top innovating startups in the region. I designed and painted our giant cocktail napkin. Check out the time-lapse I made below:</li>\n</ul>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Q7NwiLhwqpA\" frameborder=\"2\" allowfullscreen></iframe>\n<ul>\n<li>In December, I accepted the position as \"Developer, UI/UX, Programmer Outreach &#x26; Event Organizer\" for the Lesbians Who Tech Seattle Chapter for 2016.</li>\n<li>I taught five Intro to HTML/CSS/JS classes through Women Who Code and General Assembly.</li>\n<li>I gave a total of 5 talks at local meetups throughout the year.</li>\n<li>Books! I missed the mark on my reading goal for 2015 of 50 books, but I did manage to finish 37.</li>\n</ul>\n<p>2015 was a year of constant change. It was incredibly challenging at times, and at other times it seemed like the days just flew by without me noticing. Hoping 2016 brings more stability and time for growth!</p>","frontmatter":{"date_published":"December 31, 2015","path":"/2015-in-review","title":"2015 in Review"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}