{"data":{"markdownRemark":{"html":"<p><strong>How to plot coordinates on a map with Rails and the Google Maps JavaScript API</strong></p>\n<p>This tutorial will walk a rails beginner through the process of how to plot coordinates on a google map. This method is quick and easy, and will be relatively pain free.</p>\n<p><strong>Setup:</strong></p>\n<p>First, add the gem <a href=\"https://github.com/gazay/gon\">gon</a> to your gemfile:</p>\n<p><img src=\"/content/images/2014/Jul/gemfile.png\" alt=\"gemfile\"></p>\n<p>What does gon do for you?</p>\n<ul>\n<li>\n<p>It allows you to write data in your controller (or presenter or model) to a variable</p>\n</li>\n<li>\n<p>You can use the variable in your view by using data attributes to assign it to an object or by using javascript in the view.</p>\n</li>\n<li>\n<p>Then you can use the data in your javascript.</p>\n</li>\n</ul>\n<p>Find out more about using gon and passing data to javascript in <a href=\"http://railscasts.com/episodes/324-passing-data-to-javascript\">this railscast.</a></p>\n<p>(You'll see that I have included the awesome gem <a href=\"http://www.rubygeocoder.com\">geocoder</a>. I used this gem to retrieve the coordinates of a visitor to my app via their IP addesss.)</p>\n<p>Then be sure to bundle install after adding the gems to your gemfile.</p>\n<p><strong>Using gon:</strong></p>\n<p>Using gon is the simplest thing in the world. You merely assign some data to a variable with \"gon.\"\" as a prefix in your controller.</p>\n<p><img src=\"/content/images/2014/Jul/gonvariable.png\" alt=\"gon.lat_long_array as a variable set in the controller\"></p>\n<p>As you can see, I used the same format as I did for the instance variables I will use in my view, only replacing the '@' with 'gon'.</p>\n<p>In the Visitors model, I use the geocoder gem to assign latitude and longitude values to the object before saving to the database.</p>\n<p>The geocoder documentation explains this well, but in order to plot these two separate values as one marker, we are going to want to have them as an array of arrays for each entry, like this: [[lat, long], [lat, long], [lat, long]...].</p>\n<p><img src=\"/content/images/2014/Jul/coordinatemethod.png\" alt=\"method for lat long array\"></p>\n<p>As you can see, I am plucking out the latitude and longitude values of all Visitors and assigning those resulting arrays to varibles. Then I use the zip method to turn it into the array of arrays I need. Before returning the variable, be sure to delete any of the arrays if they include nil or a coordinate of \"0.0\".</p>\n<p>This is sort of a long method; if I were to refactor it, I would probably start by moving the delete_ifs out to a separate method since their concerns are different from the previous lines that query the database.</p>\n<p><strong>Now we're ready for javascript!</strong></p>\n<p>We are going to use the <a href=\"https://developers.google.com/maps/documentation/javascript/\">google maps javascript api</a> to plot our set of coordinates. You can find code samples in the offical documentation, but below is what I did:</p>\n<p><img src=\"/content/images/2014/Jul/javascript.png\" alt=\"google maps javascript\"></p>\n<p>You can see on line 11 where I bring in the latitude and longitude array. I simply assign it to a variable in javascript so I can use it. To drop a pin, you have to create a new Marker object (line 16), which is where you will include options like animation and position. Because I was interested in plotting several pins on the map at the same time from that array of coordinates, I made a simple for loop to create all the individual markers.</p>\n<p>Here's what it looks like on the page:</p>\n<p><img src=\"/content/images/2014/Jul/mapplots.png\" alt=\"google map with pin drops\"></p>\n<p>Of course, depending on your use, you will probably want to change the map options to create a custom map for what you are doing. You can find out how to do such a thing in the google javascript api docs, which will also explain how to change the types of Markers (pins) or other options you have for your new map with plotted coordinates!</p>\n<p>You can see this in action, along with my first attempts to use the canvas element over at <a href=\"http://liz-newsletter.herokuapp.com/visitors\">liz-newsletter.herokuapp.com</a>, my Ada winter break project.</p>","frontmatter":{"date_published":"February 03, 2014","path":"/how-to-plot-coordinates-on-a-map-with-rails-and-the-google-maps-javascript-api/","title":"Plotting coordinates: a simple gon gem tutorial"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}