{"data":{"markdownRemark":{"html":"<p>Last year was a big year in speaking for me! I gave 7 conference talks, spoke at 3 meet ups, spoke on one panel &#x26; was interviewed for my first podcast appearance!</p>\n<p>I didn't speak at any conferences in the year prior so I could focus on developing my technical skills, though I still did a few meet ups and panels. It was a nice break, but in 2016 I wanted to build up more of a community &#x26; network for myself so I decided to dive back in to conference speaking.</p>\n<p>The most important part of my 2016 speaking circuit was that I promised myself that I would only speak at conferences that didn't cost me money to attend. Many folks don't realize how expensive it can be to speak at a conference if you don't have a supportive employer--it can cost a $500 plane ticket, multiple hotel nights, plus incidentals &#x26; meals. So I'm proud to say that this last year I was able to travel &#x26; speak at some really wonderful conferences while having my expenses covered! Eventually I'd love to get paid to speak, but I'm happy that I made my goal of not actively losing money.</p>\n<p>I started out the year with the <a href=\"http://lesbianswhotech.org/sanfrancisco2016/\">Lesbians Who Tech Summit</a> in SF--my second time attending and it was as inspiring as always. One of the things I love the most about LWT is that it really centers women's experiences. Often times at other conferences, even ones that are focused on women in tech, sometimes it ends up accidentally still being about men: the discrimination we face because of them, the harassment, how to be the only woman in the engineering group, how to get male mentors &#x26; advocates, etc. LWT is different. It's not all women or all lesbians of course, but it is a breath of fresh air to not have to even think about men in tech for a weekend. The celebration of women's achievements in tech, the unabashed joy and fun of being around other women, and the positive atmosphere really do make it a fantastic conference.</p>\n<p>The two other women-focused conferences I spoke at were <a href=\"https://wwconnect2016.squarespace.com\">WWCONNECT</a> here in Seattle and <a href=\"http://writespeakcode.com/\">Write/Speak/Code</a> in Chicago. I loved getting to speak in Seattle and building my community here. W/S/C is another fantastic community aimed at beginners in tech. The great thing about these two conferences in contrast to LWT is that these two are technical conferences focused on developers.</p>\n<p>Write/Speak/Code was one of my favorites because I love Chicago in the early summer, I got to see my aunts &#x26; brother who live in the city, and most of all I got surprising feedback on my talk there. A friendly audience member came up to me after I gave a talk about the challenges of algorithm development &#x26; bias to tell me that I gave the \"best technical talk\" she'd seen all year! I was stunned, honestly. It was the first time anyone had said to me that I had given a technical talk. I guess I've just heard the complaint about women giving \"soft talks\" so many times that I absorbed that into my self image &#x26; assumed that my talks were also not \"technical enough\" (whatever that means). So shout out to my kind audience member--you really helped me see myself in a different light!</p>\n<p>For <a href=\"http://selfconference.org\">Self.Conference</a>, I got to visit Detroit for the first time in late May, prepping myself to return a week later for Movement. I loved getting to experience two sides of the same city: a blossoming tech scene &#x26; the awesome electronic music community. Everyone at Self.Conference was just so enthusiastic and friendly that it really changes your image of a city like Detroit. I had no idea about their tech scene until I went to Self.Conference and I'm glad I didn't miss out on this one.</p>\n<p>In October, I gave another talk here in Seattle for the <a href=\"http://www.codewritersworkshop.com\">Code Writers Workshop</a>, a one day conference focused on the career development of software engineers. I gave a talk about onboarding bootcamp graduates, and it was fantastic to have so much feedback. There were many representatives of companies in attendance where new bootcamp graduates had recently found jobs, so I had a lot of positive feedback about the immediate applicability of the information I presented, which is some of the most satisfying feedback a speaker can get.</p>\n<p>I also gave my first international conference talk this year! The unbelievably fantastic team at <a href=\"http://oredev.org\">Øredev in Malmö, Sweden</a> brought me over in November to give two talks. I just can't get over this conference! Not only did they provide all the speaker support I could imagine, they let me bring along my BF and had us participate in local activities and traditions from going to the sauna (and jumping in the Baltic Sea!!) to having the speakers' dinner at City Hall with the mayor. Not going to lie though, I was nervous about this one! It was the biggest conference I've ever spoken at and it was intimidating! I loved that they had little polling stations outside each talk so that speakers could get feedback about their talks. Scores were calculated based on frowny face, neutral face, and smiley face votes with a max score of 2 representing the smiley face vote. While the average score was a 1.48, my talks earned a 1.74 &#x26; 1.91. Pretty damn good feedback, if you ask me!</p>\n<p>The most disappointing moment in speaking for me this last year was when I was approached by a large engineering company that provides on-demand rides &#x26; ride-sharing to speak on a panel for women in tech about negotiating your salary and ensuring fair pay. While I was flattered that they sought me out based on recommendations and my history of speaking about salary negotiations, they were unable to accomodate my request to be paid a nominal and primarily symbolic speaker's fee. While many of my friends thought I should be mad, mostly I remained amused by the situation and proud of myself for asking to be paid at all.</p>\n<p>As for 2017? I have a few talk ideas bouncing around but I'm not sure if I'll develop them this year or save them for the next. I'd love to get to the next step of actually getting paid for the labor of speaking and writing talks. In the meantime, I've got some great secret projects in the works, so stay tuned!</p>","frontmatter":{"date_published":"2017-02-21T13:08:44.000Z","path":"/blog/2016-tech-conference-recap","title":"2016 Tech Conference Recap"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}